tap "aws/tap"
tap "azure/draft"
tap "caskroom/cask"
tap "domt4/autoupdate"
tap "facebook/fb"
tap "habitat-sh/habitat"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "ksonnet/tap"
tap "martido/brew-graph"
tap "mas-cli/tap"
tap "neovim/neovim"
tap "weaveworks/tap"
cask "caskroom/versions/java8"
cask "alfred"
cask "amethyst"
cask "blender"
cask "charles"
cask "chromedriver"
cask "cyberduck"
cask "disk-inventory-x"
cask "docker"
cask "dotnet-sdk"
tap "aws/tap"
tap "azure/draft"
tap "caskroom/cask"
tap "caskroom/versions"
tap "domt4/autoupdate"
tap "facebook/fb"
tap "habitat-sh/habitat"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/livecheck"
tap "homebrew/services"
tap "ksonnet/tap"
tap "martido/brew-graph"
tap "mas-cli/tap"
tap "neovim/neovim"
tap "weaveworks/tap"
cask "java"
cask "xquartz"
# Search tool like grep, but optimized for programmers
brew "ack"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# GNU database manager
brew "gdbm"
# SSL/TLS cryptography library
brew "openssl"
# Perl compatible regular expressions library
brew "pcre"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Image manipulation library
brew "jpeg"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Apache Portable Runtime library
brew "apr"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Collection of portable C++ source libraries
brew "boost"
# Formatter/translator for text files to numerous formats. Includes a2x
brew "asciidoc"
# Powerful, lightweight programming language
brew "lua"
# ASP system to ground and solve logic programs
brew "clingo"
# Package dependency solver
brew "aspcud"
# Spell checker with better logic than ispell
brew "aspell"
# GNOME accessibility toolkit
brew "atk"
# C++ interface to glib
brew "glibmm"
# Official C++ interface for the ATK accessibility toolkit library
brew "atkmm"
# Configuration editing tool and API
brew "augeas"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Client interface to the Amazon EC2 web service
brew "ec2-api-tools"
# Client for Amazon CloudFormation web service
brew "aws-cfn-tools"
# Client for Amazon ElastiCache web service
brew "aws-elasticache"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# TAP-compliant test framework for Bash scripts
brew "bats"
# Friendly powerful distributed version control system
brew "bazaar"
# Google's own build tool
brew "bazel"
# Garbage collector for C and C++
brew "bdw-gc"
# GNU multiple precision arithmetic library
brew "gmp"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Safely store secrets in Git/Mercurial/Subversion
brew "blackbox"
# Interface bandwidth monitor
brew "bmon"
# C++ build system
brew "boost-build"
# Platform built on V8 to build network applications
brew "node"
# Package manager for the web
brew "bower"
# Generate and apply patches to binary files
brew "bsdiff"
# Backup tool
brew "bup"
# Asynchronous DNS library
brew "c-ares"
# Command-line client for DAV
brew "cadaver"
# Vector graphics library with cross-device output support
brew "cairomm"
# General purpose programming language in the ML family
brew "ocaml"
# Generic build tool for OCaml
brew "ocamlbuild"
# Tool to write extensible parsers in OCaml
brew "camlp4"
# Compiler for writing C extensions for the Python language
brew "cython"
# Eventually consistent, distributed key-value store
brew "cassandra"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# CloudFlare's PKI toolkit
brew "cfssl"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# Generate code for scanning Z-polyhedra
brew "cloog"
# Amazon CloudWatch command-line Tool
brew "cloud-watch"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# Tool for service discovery, monitoring and configuration
brew "consul"
# Generic template rendering and notifications with Consul
brew "consul-template"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Wordlist generator
brew "crunch"
# Reimplementation of ctags(1)
brew "ctags"
# Lightweight unit testing framework for C
brew "cunit"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus"
# GNU Portable THreads
brew "pth"
# Server for managing certificate revocation lists
brew "dirmngr"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Isolated development environments using Docker
brew "docker-compose"
# Docker-compose completion script
brew "docker-compose-completion"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Docker Machine driver for xhyve
brew "docker-machine-driver-xhyve"
# Utility to simplify running applications in docker containers
brew "dockerize"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Debian package management system
brew "dpkg"
# Command-line interface for Cyberduck (a multi-protocol file transfer tool)
brew "duck"
# Docker Version Manager
brew "dvm"
# Amazon EC2 AMI Tools (helps bundle Amazon Machine Images)
brew "ec2-ami-tools"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# C++ template library for linear algebra
brew "eigen"
# Distributed search & analytics engine
brew "elasticsearch"
# Text mode web browser
brew "elinks"
# GNU Emacs text editor
brew "emacs"
# Convert text to Postscript, HTML, or RTF, with syntax highlighting
brew "enscript"
# Run arbitrary commands when files change
brew "entr"
# Key value store for shared configuration and service discovery
brew "etcd"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# ISO AAC audio decoder
brew "faad2"
# Library and utilities for processing GIFs
brew "giflib"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# H.264/AVC encoder
brew "x264"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# X11 implementation of the Remote Desktop Protocol (RDP)
brew "freerdp"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc@6"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# Submit git branches to gerrit for review
brew "git-review"
# Track changes to a patch series over time
brew "git-series"
# Find where a commit was merged in git
brew "git-when-merged"
# Cross platform, open source .NET development framework
brew "mono"
# Easy semantic versioning for projects using Git
brew "gitversion"
# Command-line option parsing library
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU implementation of which utility
brew "gnu-which"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Small utility that generates Go code from any file
brew "go-bindata"
# Lightweight database library
brew "tokyo-cabinet"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GPG key agent
brew "gpg-agent"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Java-based scripting language
brew "groovy"
# Numerical library for C and C++
brew "gsl"
# Fallback theme for FreeDesktop.org icon themes
brew "hicolor-icon-theme"
# GUI toolkit
brew "gtk+"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# C++ interface to Pango
brew "pangomm"
# C++ interfaces for GTK+ and GNOME
brew "gtkmm"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# malloc implementation emphasizing fragmentation avoidance
brew "jemalloc"
# HTTP/2 C Library
brew "nghttp2"
# Apache HTTP server
brew "httpd", restart_service: true
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Display an interface's bandwidth usage
brew "iftop"
# OpenEXR ILM Base libraries (high dynamic-range image file format)
brew "ilmbase"
# High dynamic-range image file format
brew "openexr"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# String tool
brew "intltool"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Modular IRC client
brew "irssi"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Command-line JSON pretty-printer
brew "jsonpp"
# DevOps management tool
brew "juju"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Wait for events on files or directories on macOS
brew "kqwait"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# The Kubernetes package manager
brew "kubernetes-helm"
# Command-line, double-entry accounting tool
brew "ledger"
# Very basic terminfo library
brew "unibilium"
# Version 1 of the Little CMS library
brew "little-cms"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Rotates, compresses, and mails system logs
brew "logrotate", restart_service: true
# Utility to list open files
brew "lsof"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Text-based web browser
brew "lynx"
# Real-time data compression library
brew "lzo"
# Utility for directing compilation
brew "make"
# Creates dependencies in makefiles
brew "makedepend"
# The mandoc UNIX manpage compiler toolset
brew "mandoc"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# High-performance, schema-free, document-oriented database
brew "mongodb"
# Remote terminal application
brew "mosh"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Mongrel of mail user agents (part elm, pine, mush, mh, etc.)
brew "mutt"
# Node version management
brew "n"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Net top tool grouping bandwidth per process
brew "nethogs"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Realtime console network usage monitor
brew "nload"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# The OCaml package manager
brew "opam"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Shell command parallelization utility
brew "parallel"
# Small collection of programs that operate on patch files
brew "patchutils"
# Display the PID number for a given process name
brew "pidof"
# Python dependency management tool
brew "pipenv"
# Shortcut for the 'ps aux | grep' idiom
brew "psgrep"
# Parallel versions of OpenSSH and related tools
brew "pssh"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# x86 and PowerPC Emulator
brew "qemu"
# Software environment for statistical computing
brew "r"
# File browser
brew "ranger"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# UNIX client for connecting to Windows Remote Desktop Services
brew "rdesktop"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Convert character set (charsets)
brew "recode"
# Implements djb's redo: an alternative to make(1)
brew "redo"
# Fast, efficient and secure backup program
brew "restic"
# Tool to convert RPM package to CPIO archive
brew "rpm2cpio"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Library for creating multi-platform software
brew "s-lang"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Browser automation for testing purposes
brew "selenium-server-standalone"
# Autoformat shell script source code
brew "shfmt"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Experimental implementation of SPDY protocol versions 2, 3, and 3.1
brew "spdylay"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Advanced proxy caching server for HTTP, HTTPS, FTP, and Gopher
brew "squid"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform"
# Export existing AWS resources to Terraform style (tf, tfstate)
brew "terraforming"
# Convert TeXinfo files to HTML
brew "texi2html"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Code-search similar to ack
brew "the_silver_searcher"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Text interface for Git repositories
brew "tig"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Command-line client for Travis CI
brew "travis"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Collection of Linux utilities
brew "util-linux"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Display word differences between text files
brew "wdiff"
# Enhances tmux's to provide multiuser terminal multiplexing
brew "wemux"
# Internet file retriever
brew "wget"
# Program for applying patches with conflicting changes
brew "wiggle"
# Remote Windows-command executor
brew "winexe"
# Graphical network analyzer and capture tool
brew "wireshark"
# Lightweight macOS virtualization solution based on FreeBSD's bhyve
brew "xhyve"
# Powerful interactive system for text processing
brew "xml-coreutils"
# XML command-line utilities
brew "xmlstarlet"
# Yet Another JSON Library
brew "yajl"
# JavaScript package manager
brew "yarn"
# Modular BSD reimplementation of NASM
brew "yasm"
# Process YAML documents from the CLI
brew "yq"
# Tracks most-used directories to make cd smarter
brew "z"
# A tool for developers to create cloud-native applications on Kubernetes.
brew "azure/draft/draft"
# The Habitat command line application
brew "habitat-sh/habitat/hab"
# The ksonnet command line utility. Manage and deploy Kubernetes applications.
brew "ksonnet/tap/ks"
brew "martido/brew-graph/brew-graph"
# a CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
cask "alfred"
cask "amethyst"
cask "atom"
cask "blender"
cask "charles"
cask "chromedriver"
cask "cyberduck"
cask "disk-inventory-x"
cask "docker"
cask "dotnet-sdk"
cask "drawio"
cask "dropbox"
cask "firefox"
cask "flycut"
cask "gitter"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "intellij-idea"
cask "iterm2"
cask "keybase"
cask "kindle"
cask "kitematic"
cask "macpass"
cask "mactex"
cask "minikube"
cask "mongodb"
cask "mono-mdk"
cask "mysql-shell"
cask "mysqlworkbench"
cask "neo4j"
cask "obs"
cask "opera"
cask "paste"
cask "phantomjs"
cask "postman"
cask "powershell"
cask "pycharm"
cask "robo-3t"
cask "screenflick"
cask "skype"
cask "slack"
cask "spectacle"
cask "the-unarchiver"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "yed"
cask "caskroom/versions/java8"
cask "caskroom/versions/powershell-preview"
mas "Microsoft Remote Desktop", id: 1295203466
mas "Xcode", id: 497799835
